app/controllers/api/cars_controller.rb

    def index
        #@cars = Car.page(params[:page])

        @cars = Car.page(params[:page]).per(5)
---
SELECT "cars".* FROM "cars" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]

    def create
        # @cars = policy_scope(Car)
        @car = Car.new(car_params)

        if @car.save
---
INSERT INTO "cars" ("brand", "model", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["brand", "test"], ["model", "test"], ["year", "test"], ["created_at", "2020-11-29 21:46:23.227654"], ["updated_at", "2020-11-29 21:46:23.227654"]]

    def destroy
        # @cars = policy_scope(Car)
        @car = Car.where( id: params[:id]).first
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update

     @car = Car.find(params[:id])

      if @car.update(car_params)
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cars" SET "brand" = $1, "model" = $2, "year" = $3, "updated_at" = $4 WHERE "cars"."id" = $5  [["brand", "Audi"], ["model", "Ram"], ["year", "2019"], ["updated_at", "2020-11-29 21:37:53.720496"], ["id", 2]]

    def show
        # @cars = policy_scope(Car)
        @car = Car.find(params[:id])
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]