app/controllers/api/cars_controller.rb

SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update

     @car = Car.find(params[:id])