app/controllers/api/cars_details_controller.rb

SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def get_cars_detail
    @car = Car.find(params[:car_id])

SELECT "cars_details".* FROM "cars_details" WHERE "cars_details"."car_id" = $1 AND "cars_details"."id" = $2 LIMIT $3  [["car_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_cars_detail
      @cars_detail = @car.carsDetail.find(params[:id])