app/controllers/api/sessions_controller.rb

def create
# super
   @user = User.where(email: params[:email]).first
---
SELECT "users".* FROM "users" WHERE "users"."email" IS NULL ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]