app/controllers/cars_controller.rb

UPDATE "cars" SET "year" = $1, "updated_at" = $2 WHERE "cars"."id" = $3  [["year", "2019"], ["updated_at", "2020-11-26 11:45:26.876918"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @car.update(car_params)