app/controllers/cars_details_controller.rb

INSERT INTO "cars_details" ("Rate", "Avis", "car_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["Rate", "4"], ["Avis", "test4"], ["car_id", 5], ["created_at", "2020-11-26 11:58:02.849337"], ["updated_at", "2020-11-26 11:58:02.849337"]]
---
  def create

    @cars_detail = CarsDetail.new(cars_detail_params)
    # @cars_detail = @car.carsDetail.build(cars_detail_params)
    respond_to do |format|
      if @cars_detail.save

UPDATE "cars_details" SET "Rate" = $1, "updated_at" = $2 WHERE "cars_details"."id" = $3  [["Rate", "6"], ["updated_at", "2020-11-26 11:47:48.115516"], ["id", 1]]
---
  def update

    respond_to do |format|

      if @cars_detail.update(cars_detail_params)

SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def get_cars_detail
    @car = Car.find(params[:car_id])

SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "cars_details".* FROM "cars_details" WHERE "cars_details"."car_id" = $1 AND "cars_details"."id" = $2 LIMIT $3  [["car_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_cars_detail
      @cars_detail = @car.carsDetail.find(params[:id])